/**
 * @file pi3bplus.h
 * @author your name (you@domain.com)
 * @brief 
 * @version 0.1
 * @date 2022-07-05
 * 
 * @copyright Copyright (c) 2022
 * 
 */
#pragma once

typedef unsigned char uint8_t;
typedef unsigned short uint16_t;
typedef unsigned int uint32_t;
typedef unsigned long  uint64_t;
typedef int bool;

#ifndef __IM                                    /*!< Fallback for older CMSIS versions                                         */
  #define __IM   volatile
#endif
#ifndef __OM                                    /*!< Fallback for older CMSIS versions                                         */
  #define __OM   volatile
#endif
#ifndef __IOM                                   /*!< Fallback for older CMSIS versions                                         */
  #define __IOM  volatile
#endif


typedef enum {
/* =======================================  ARM Cortex-A53 Specific Interrupt Numbers  ======================================= */
/* ========================================  bcm2837_lpa Specific Interrupt Numbers  ========================================= */
  TIMER_0_IRQn              =   0,              /*!< 0  Timer 0 matched                                                        */
  TIMER_1_IRQn              =   1,              /*!< 1  Timer 1 matched                                                        */
  TIMER_2_IRQn              =   2,              /*!< 2  Timer 2 matched                                                        */
  TIMER_3_IRQn              =   3,              /*!< 3  Timer 3 matched                                                        */
  USB_IRQn                  =   9,              /*!< 9  USB interrupt                                                          */
  AUX_IRQn                  =  29,              /*!< 29 Interrupt from AUX                                                     */
  GPIO0_IRQn                =  49,              /*!< 49 Interrupt from bank 0                                                  */
  GPIO1_IRQn                =  50,              /*!< 50 Interrupt from bank 1                                                  */
  GPIO2_IRQn                =  51,              /*!< 51 Interrupt from bank 2                                                  */
  GPIO_IRQn                 =  52,              /*!< 52 OR of all GPIO interrupts                                              */
  I2C_IRQn                  =  53,              /*!< 53 OR of all I2C interrupts                                               */
  SPI_IRQn                  =  54,              /*!< 54 OR of all SPI interrupts except 1 and 2                                */
  UART_IRQn                 =  57,              /*!< 57 OR of all UART interrupts except 1                                     */
  EMMC_IRQn                 =  62               /*!< 62 OR of EMMC and EMMC2                                                   */
} IRQn_Type;

/* =========================================================================================================================== */
/* ================                                           GPIO                                            ================ */
/* =========================================================================================================================== */




/**
  * @brief Pin level and mux control (GPIO)
  */

typedef struct {                                /*!< (@ 0x3F200000) GPIO Structure                                             */
  /* 0x00 */ volatile uint32_t GPFSEL0; /* GPIO Function Select 0 */ 
  /* 0x04 */ volatile uint32_t GPFSEL1; /* GPIO Function Select 1 */
  /* 0x08 */ volatile uint32_t GPFSEL2; /* GPIO Function Select 2 */
  /* 0x0c */ volatile uint32_t GPFSEL3; /* GPIO Function Select 3 */
  /* 0x10 */ volatile uint32_t GPFSEL4; /* GPIO Function Select 4 */
  /* 0x14 */ volatile uint32_t GPFSEL5; /* GPIO Function Select 5 */
                      uint32_t reserved;
  /* 0x1c */ volatile uint32_t GPSET0; /* GPIO Pin Output Set 0 */
  /* 0x20 */ volatile uint32_t GPSET1; /* GPIO Pin Output Set 1 */
                      uint32_t reserved1;
  /* 0x28 */ volatile uint32_t GPCLR0; /* GPIO Pin Output Clear 0 */
  /* 0x2c */ volatile uint32_t GPCLR1; /* GPIO Pin Output Clear 1 */
                      uint32_t reserved2;
  /* 0x34 */ volatile uint32_t GPLEV0; /* GPIO Pin Level 0 */
  /* 0x38 */ volatile uint32_t GPLEV1; /* GPIO Pin Level 1 */
  /* 0x40 */ volatile uint32_t GPEDS0; /* GPIO Pin Event Detect Status 0 */
  /* 0x44 */ volatile uint32_t GPEDS1; /* GPIO Pin Event Detect Status 1 */
  /* 0x4c */ volatile uint32_t GPREN0; /* GPIO Pin Rising Edge Detect Enable 0 */
  /* 0x50 */ volatile uint32_t GPREN1; /* GPIO Pin Rising Edge Detect Enable 1 */
                      uint32_t reserved3;
  /* 0x58 */ volatile uint32_t GPFEN0; /* GPIO Pin Falling Edge Detect Enable 0 */
  /* 0x5c */ volatile uint32_t GPFEN1; /* GPIO Pin Falling Edge Detect Enable 1 */
                      uint32_t reserved4;
  /* 0x64 */ volatile uint32_t GPHEN0; /* GPIO Pin High Detect Enable 0 */
  /* 0x68 */ volatile uint32_t GPHEN1; /* GPIO Pin High Detect Enable 1 */
                      uint32_t reserved5;
  /* 0x70 */ volatile uint32_t GPLEN0; /* GPIO Pin Low Detect Enable 0 */
  /* 0x74 */ volatile uint32_t GPLEN1; /* GPIO Pin Low Detect Enable 1 */
                      uint32_t reserved6[2];
  /* 0x7c */ volatile uint32_t GPAREN0; /* GPIO Pin Async. Rising Edge Detect 0 */
  /* 0x80 */ volatile uint32_t GPAREN1; /* GPIO Pin Async. Rising Edge Detect 1 */
              uint32_t reserved7;
  /* 0x88 */ volatile uint32_t GPAFEN0; /* GPIO Pin Async. Falling Edge Detect 0 */
  /* 0x8c */ volatile uint32_t GPAFEN1; /* GPIO Pin Async. Falling Edge Detect 1 */
                      uint32_t reserved8[22];
  /* 0xe4 */ volatile uint32_t GPIO_PUP_PDN_CNTRL_REG0; /* GPIO Pull-up / Pull-down Register 0 */
  /* 0xe8 */ volatile uint32_t GPIO_PUP_PDN_CNTRL_REG1; /* GPIO Pull-up / Pull-down Register 1 */
  /* 0xec */ volatile uint32_t GPIO_PUP_PDN_CNTRL_REG2; /* GPIO Pull-up / Pull-down Register 2 */
  /* 0xf0 */ volatile uint32_t GPIO_PUP_PDN_CNTRL_REG3; /* GPIO Pull-up / Pull-down Register 3 */
} GPIO_Type;                                    /*!< Size = 244 (0xf4)                                                         */


/* =========================================================================================================================== */
/* ================                                           UART0                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief ARM Prime Cell PL011 (UART0)
  */

typedef struct {                                /*!< (@ 0x3F201000) UART0 Structure                                            */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Data Register                                              */
    
    struct {
